In [1]:
import pandas as pd
from sklearn.cross_validation import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import classification_report

/home/hadoop/.local/lib/python2.7/site-packages/sklearn/cross_validation.py:44: DeprecationWarning: This module was deprecated in version 0.18 in favor of the model_selection module into which all the refactored classes and functions are moved. Also note that the interface of the new CV iterators are different from that of this module. This module will be removed in 0.20.
  "This module will be removed in 0.20.", DeprecationWarning)

In [2]:
user_info_train = pd.read_csv('../../pcredit/train/user_info_train.txt',
                                  header = None)
user_info_test = pd.read_csv('../../pcredit/test/user_info_test.txt',
                                 header = None)
# 设置字段（列）名称
col_names = ['userid', 'sex', 'occupation', 'education', 'marriage', 'household']
user_info_train.columns = col_names
user_info_test.columns = col_names
# 合并train、test
user_info = pd.concat([user_info_train, user_info_test])
user_info.head()

   userid  sex  occupation  education  marriage  household
0    3150    1           2          4         1          4
1    6965    1           2          4         3          2
2    1265    1           3          4         3          1
3    6360    1           2          4         3          2
4    2583    2           2          2         1          1

In [3]:
user_info.index = user_info['userid']
user_info.head()

        userid  sex  occupation  education  marriage  household
userid
3150      3150    1           2          4         1          4
6965      6965    1           2          4         3          2
1265      1265    1           3          4         3          1
6360      6360    1           2          4         3          2
2583      2583    2           2          2         1          1

In [4]:
user_info.drop('userid',
                axis = 1,
                inplace = True)
user_info.head()

        sex  occupation  education  marriage  household
userid
3150      1           2          4         1          4
6965      1           2          4         3          2
1265      1           3          4         3          1
6360      1           2          4         3          2
2583      2           2          2         1          1

In [5]:
# bank_detail
bank_detail_train = pd.read_csv('../../pcredit/train/bank_detail_train.txt',
                                    header = None)
bank_detail_test = pd.read_csv('../../pcredit/test/bank_detail_test.txt',
                                    header = None)
col_names = ['userid', 'tm_encode', 'trade_type', 'trade_amount', 'salary_tag']
bank_detail_train.columns = col_names
bank_detail_test.columns = col_names
bank_detail = pd.concat([bank_detail_train, bank_detail_test])
# 在该数据集中，一个用户对应多条记录，这里我们采用对每个用户每种交易类型取均值进行聚合
bank_detail_n = (bank_detail.loc[:, ['userid', 'trade_type', 'trade_amount', 'tm_encode']])\
        .groupby(['userid', 'trade_type']).mean()

In [6]:
bank_detail_n.head()

                   trade_amount   tm_encode
userid trade_type
1      0              13.734079  5900125921
       1              13.255397  5900935322
3      0              13.249264  4767556643
       1               9.834236  5899778320
4      0              12.128566  5042088336

In [7]:
bank_detail_n = bank_detail_n.unstack()
bank_detail_n.head()

           trade_amount                tm_encode
trade_type            0          1             0             1
userid
1             13.734079  13.255397  5.900126e+09  5.900935e+09
3             13.249264   9.834236  4.767557e+09  5.899778e+09
4             12.128566  10.920132  5.042088e+09  5.902715e+09
9             14.371789  12.867697  5.004267e+09  5.910709e+09
10            12.720866  12.296680  5.912361e+09  5.911718e+09

In [8]:
bank_detail_n.columns = ['income', 'outcome', 'income_tm', 'outcome_tm']  #  修改列名
bank_detail_n.head(5)

           income    outcome     income_tm    outcome_tm
userid
1       13.734079  13.255397  5.900126e+09  5.900935e+09
3       13.249264   9.834236  4.767557e+09  5.899778e+09
4       12.128566  10.920132  5.042088e+09  5.902715e+09
9       14.371789  12.867697  5.004267e+09  5.910709e+09
10      12.720866  12.296680  5.912361e+09  5.911718e+09